workstation/tutorials/combustion/fireFoam/LES/compartmentFire/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101325;
    }

    entrainment
    {
        type            totalPressure;
        p0              uniform 101325;
    }

    outlet
    {
        type            totalPressure;
        p0              uniform 101325;
    }

    region0_to_panelRegion_wallPanel
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101325;
    }

    region0_to_panelRegion_internalWallPanel_top
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101325;
    }

    region0_to_panelRegion_internalWallPanel_bottom
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101325;
    }
}


// ************************************************************************* //
